# Pandas notes

## Pandas Series (and is advantages over a List)

In [1]:
# Indexing - pd.Series allows for labeled indexing, which means you can access data using labels instead of just integer positions.
import pandas as pd
s = pd.Series([1, 2, 3], index=['a', 'b', 'c']) # if you skip the index, it will be 0, 1, 2, ...
print(s['a'])  # Output: 1

1

In [2]:
# Data Alignement - When adding two series, the data aligns based on the index. If the index does not match, the result will be NaN.
s1 = pd.Series([1, 2, 3], index=['a', 'b', 'c'])
s2 = pd.Series([4, 5, 6], index=['b', 'c', 'd'])
print(s1 + s2)

a    NaN
b    6.0
c    8.0
d    NaN
dtype: float64

In [3]:
# Vectorized Operations: pd.Series supports vectorized operations, which means you can perform operations on the entire series without needing to loop through each element.
s = pd.Series([1, 2, 3])
print(s * 2)

0    2
1    4
2    6
dtype: int64

In [4]:
s3 = pd.Series(range(10), index=range(10))
print(s3)
print(s3>5)    # Output: True for values > 5, False for values <= 5
print(s3[s3>5])    # Output: values > 5

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64
0    False
1    False
2    False
3    False
4    False
5    False
6     True
7     True
8     True
9     True
dtype: bool
6    6
7    7
8    8
9    9
dtype: int64

In [5]:
# Sample dictionary
data = {'a': 1, 'b': 2, 'c': 3, 'd': 4}

# Transform dictionary into pd.Series
series = pd.Series(data)    # key becomes index, value becomes value

# Print the resulting Series
print(series)

a    1
b    2
c    3
d    4
dtype: int64

## Pandas DataFrame

In [6]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

# Transform dictionary into pd.DataFrame
df = pd.DataFrame(data)

# Print the resulting DataFrame
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [7]:
data['Name'].append('David')
data['Age'].append(40)
data['City'].append('Boston')
df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40       Boston

In [23]:
# Filtering DataFrames - 2 methods, or actually 3
# 1. using square brackets
filtered_df = df[['Age', 'City']]    # Output: DataFrame with only 'Age' and 'City' columns
print(filtered_df)                   # Interesting that columns filtering needs double square brackets
print('-----------------')

filtered_df = df[df['Age'] > 30]    # Output: DataFrame with only rows where 'Age' > 30
print(filtered_df)
print('-----------------')

filtered_df = df[:2]    # Output: First two rows of the DataFrame
print(filtered_df)
print('-----------------')

filtered_df = df[2:3][['Age', 'Name']]    # Fixed: Use double square brackets to select multiple columns, first rows then columns
print(filtered_df)                        # Intereeesting that rows filtering needs single square brackets
print('-----------------')

# 2. using dot notation - this however will not work if the column name has spaces or special characters

print(f'{df.Age}\n{df.Name}')    # Output: 'Age' and 'Name' columns of the DataFrame
print('-----------------')

   Age         City
0   25     New York
1   30  Los Angeles
2   35      Chicago
3   40       Boston
-----------------
      Name  Age     City
2  Charlie   35  Chicago
3    David   40   Boston
-----------------
    Name  Age         City
0  Alice   25     New York
1    Bob   30  Los Angeles
-----------------
   Age     Name
2   35  Charlie
-----------------
0    25
1    30
2    35
3    40
Name: Age, dtype: int64
0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object
-----------------

In [28]:
# 3. using loc and iloc
# loc is a method to select rows by labels based indexes
# df.loc[what rows to filter, what columns to select]
# iloc is a method to select rows by integer based indexes
# df.iloc[what rows to filter, what columns to select]

print(df.loc[: , ['Age', 'Name']])    # Output: 'Age' and 'Name' columns of the DataFrame
print('-----------------')

print(df.loc[1:2 , ['Age', 'Name']])    # Output: 'Age' and 'Name' columns of the DataFrame but only rows 1 and 2

print(df.iloc[1:2 , [0, 1]])    # Output: 'Age' and 'Name' columns of the DataFrame but only rows 1 to 2 (without 2)

   Age     Name
0   25    Alice
1   30      Bob
2   35  Charlie
3   40    David
-----------------
   Age     Name
1   30      Bob
2   35  Charlie

      Name  Age
1      Bob   30
2  Charlie   35

## Loading data into DataFrame

In [50]:
import pandas as pd

df = pd.read_csv('../ML_intel_cert_project/dataset/train.csv', header=0) # header=0 means the first row is header row
# header can be None, which means there is no header row, in such case pandas will assign default header row which is 0, 1, 2, ...
# we can create header with names by passing a list of names to header parameter

print(df.head())    # Output: first 5 rows of the DataFrame
# this looks bad in stadard terminal, maybe its better to rely on jupyter notebook for this and skip print
df.head()    # Output: first 5 rows of the DataFrame

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [52]:
# so with list of names for headers (which since we already have header will overwrite):
df = pd.read_csv('../ML_intel_cert_project/dataset/train.csv', header=0, names=['Name', 'Age', 'City', 'Country', 'Job'])
df.head()

,,,,,,,Name,Age,City,Country,Job
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [54]:
# we can also sometimes need to use labels for rows, in such case we can use index_col parameter
df = pd.read_csv('../ML_intel_cert_project/dataset/train.csv', header=0, index_col='Name')
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [55]:
# sometimes we need to only load specific columns, in such case we can use usecols parameter
df = pd.read_csv('../ML_intel_cert_project/dataset/train.csv', header=0, usecols=['Name', 'Age'])
df.head()

                                                Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                           Allen, Mr. William Henry  35.0

In [57]:
# to find out data types of each column

df = pd.read_csv('../ML_intel_cert_project/dataset/train.csv', header=0)
print(df.dtypes)

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [ ]:
# this is however not accurate since Survived is actually a bool, so we can adjust that by:
df = pd.read_csv('../ML_intel_cert_project/dataset/train.csv', header=0, dtype={'Survived': bool})
print(df.dtypes) # actually its better to use .info() method as it prints this and more
df.head()

PassengerId      int64
Survived          bool
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    bool
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: bool(1), float64(2), int64(4), object(5)
memory usage: 77.6+ KB